first_test/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cwipiIcoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.005;

deltaT          0.005;

writeControl    timeStep;

writeInterval   2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

cwipiSwitch     true;

cwipiDim        3;

cwipiStep       1;

cwipiObs 	 5;

cwipiMembers 	 10;

cwipiParams	 1;


// ************************************************************************* //

functions
{
/*probes
     {
         type            probes;
         libs            ("libsampling.so");

  
         // Write at same frequency as fields
         writeControl    timeStep;
         writeInterval   2;
  
         // Fields to be probed
         fields
         (          
         U
         );
 
         probeLocations
         (
( 0.0425 0.0975 0.005 )
( 0.0475 0.0975 0.005 )
( 0.0525 0.0975 0.005 )
( 0.0575 0.0975 0.005 )
( 0.06 0.0975 0.005 )

         );
 
     }*/
}
